<!DOCTYPE html>
<html>
<head>
	<title>Задание 4</title>
</head>
<body>

	<h3>Задание 4</h3>
	<h4>Ниже выведены переменные и пояснения - корректно они заданы или нет</h4>
	
	<p>let mode = "normal"; //Корректное.</p>
	<p>let my_valu3 = 102; //Корректное.</p>
	<p>let 3my_value3 = "102"; //Некорректное. Нельзя начинать имя переменной с цифры.</p>
	<p>let __hello__ = "world"; //Корректное.</p>
	<p>let $$$ = "money"; //Корректное.</p>
	<p>let !0_world = true; //Некорректное. Нельзя использовать в названии переменной восклицательный знак.*/</p>

	<script>


	    /*let mode = "normal"; //Корректное.
		let my_valu3 = 102; //Корректное.
		//let 3my_value3 = "102"; //Некорректное. Нельзя начинать имя переменной с цифры.
		let __hello__ = "world"; //Корректное.
		let $$$ = "money"; //Корректное.
		let !0_world = true; //Некорректное. Нельзя использовать в названии переменной восклицательный знак.*/
		
	</script>

	<br><br><a href="/index.php">На главную</a>

</body>
</html>